InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеТиповРозничныхТочекИТорговыхМарок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеТиповРозничныхТочекИТорговыхМарок</Name>
			<Comment>Соответствие типов розничных точек и торговых марок</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТипРозничнойТочки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРозничныхТочек</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяМарка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеМарки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры/Ext/RecordSetModule.bsl
//+++АК KIRN 2018.03.02 ИП-00017976.01    
Процедура ПриЗаписи(Отказ, Замещение)
	//ЭтотОбъект.ДополнительныеСвойства.Вставить("РезультатПроверки","Ок");
	Если ЭтотОбъект.Количество()=0 Тогда
		Возврат;
	Конецесли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫРАЗИТЬ(т.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	               |	т.НомерСтроки,
	               |	ВЫРАЗИТЬ(т.ТипЦен КАК Справочник.ТипыЦен) КАК ТипЦен,
	               |	ВЫРАЗИТЬ(т.ТорговаяТочка КАК Справочник.СтруктурныеЕдиницы) КАК ТорговаяТочка
	               |ПОМЕСТИТЬ вт_Набор0
	               |ИЗ
	               |	&Набор КАК т
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	т.Номенклатура КАК Номенклатура,
	               |	т.НомерСтроки,
	               |	т.ТипЦен КАК ТипЦены,
	               |	т.ТорговаяТочка КАК ТорговаяТочка,
	               |	т.Номенклатура.ТорговаяМарка КАК ТорговаяМарка,
	               |	т.ТипЦен.ТорговаяМарка КАК ТорговаяМаркаЦены,
	               |	т.ТорговаяТочка.ТипРозничнойТочки КАК ТипТТ
	               |ПОМЕСТИТЬ вт_Набор
	               |ИЗ
	               |	вт_Набор0 КАК т
				   |ГДЕ 
				   |	т.ТорговаяТочка <> &ПустаяТТ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт.НомерСтроки,
	               |	вт.Номенклатура,
	               |	вт.ТорговаяМарка,
	               |	вт.ТорговаяМаркаЦены,
	               |	вт.ТипЦены,
	               |	вт.ТорговаяТочка,
	               |	вт.ТипТТ,
	               |	рс.ТорговаяМарка КАК ТорговаяМаркаС
	               |ИЗ
	               |	вт_Набор КАК вт
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеТиповРозничныхТочекИТорговыхМарок КАК рс
	               |		ПО вт.ТорговаяМарка = рс.ТорговаяМарка
	               |			И вт.ТипТТ = рс.ТипРозничнойТочки
	               |ГДЕ
	               |	(вт.ТорговаяМарка <> вт.ТорговаяМаркаЦены
	               |			ИЛИ рс.ТорговаяМарка ЕСТЬ NULL)";
	тз_Набор = ЭтотОбъект.Выгрузить();
	Запрос.УстановитьПараметр("Набор",тз_Набор);
	Запрос.УстановитьПараметр("ПустаяТТ",Справочники.СтруктурныеЕдиницы.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕСли;
	Выборка = РезультатЗапроса.Выбрать();
	ТекстОшибки = "";
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		Если Выборка.ТорговаяМарка <> Выборка.ТорговаяМаркаЦены Тогда
			ТекстОшибки = ТекстОшибки+"
			|№"+Выборка.НомерСтроки+" для номенклатуры <"+Выборка.Номенклатура+"> торговая марка <"+Выборка.ТорговаяМарка+"> не соответствует торговой марке цены <"+Выборка.ТорговаяМаркаЦены+">";
		ИначеЕсли Не ЗначениеЗаполнено(Выборка.ТорговаяМаркаС) Тогда
			ТекстОшибки = ТекстОшибки+"
			|№"+Выборка.НомерСтроки+" для номенклатуры <"+Выборка.Номенклатура+"> торговая марка <"+Выборка.ТорговаяМарка+"> не соответствует типу розничной точки <"+Выборка.ТипТТ+">";
		КонецЕСли;
	КонецЦикла;
	
	Если Отказ Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ТекстОшибки;
		Сообщение.УстановитьДанные(тз_Набор[0].Регистратор);
		Сообщение.Сообщить();
	КонецЕСли;
	
КонецПроцедуры
//---АК KIRN
